In [3]:
import numpy as np

In [9]:
a = np.array([[0,1,2,3,4],
             [9,8,7,6,5]])

In [10]:
a.ndim  #数组维度  看紧接着(后[的个数就行

2

In [11]:
a

array([[0, 1, 2, 3, 4],
       [9, 8, 7, 6, 5]])

In [12]:
a.shape   #几行几列  楼上

(2, 5)

In [13]:
a.size   #内存 就是数据个数

10

In [14]:
a.dtype

dtype('int64')

In [15]:
a.itemsize  #返回数组中每个元素的字节单位长度   楼上说了是int32   32/8=4   8为一个字节

8

## 数组与标量的计算

In [16]:
a = np.arange(24).reshape((2,3,4))   #0-23 注意shape是属性，reshape()是方法。三个参数就是整体3维，2->最外层2维，3->次层3维，4->最里4个数字

In [17]:
a

array([[[ 0,  1,  2,  3],
        [ 4,  5,  6,  7],
        [ 8,  9, 10, 11]],

       [[12, 13, 14, 15],
        [16, 17, 18, 19],
        [20, 21, 22, 23]]])

In [18]:
a.mean() #所有元素的平均值

11.5

In [19]:
a=a/a.mean()
a

array([[[0.        , 0.08695652, 0.17391304, 0.26086957],
        [0.34782609, 0.43478261, 0.52173913, 0.60869565],
        [0.69565217, 0.7826087 , 0.86956522, 0.95652174]],

       [[1.04347826, 1.13043478, 1.2173913 , 1.30434783],
        [1.39130435, 1.47826087, 1.56521739, 1.65217391],
        [1.73913043, 1.82608696, 1.91304348, 2.        ]]])

In [20]:
np.abs(1)#(fabs sqrt squrae log log10 log2 ceil floor rint modf cos cosh sin sinh tan tanh exp sign)
# 随时查询   楼下help
? np.abs

In [21]:
np.square(a)# 注意是返回值还是原位修改  各元素的平方

array([[[0.        , 0.00756144, 0.03024575, 0.06805293],
        [0.12098299, 0.18903592, 0.27221172, 0.3705104 ],
        [0.48393195, 0.61247637, 0.75614367, 0.91493384]],

       [[1.08884688, 1.2778828 , 1.48204159, 1.70132325],
        [1.93572779, 2.1852552 , 2.44990548, 2.72967864],
        [3.02457467, 3.33459357, 3.65973535, 4.        ]]])

In [22]:
sn=np.random.randn(3,4,5) #randn函数返回一个或一组样本，具有标准正态分布。标准正态分布又称为u分布，是以0为均值、以1为标准差的正态分布，记为N（0，1）

In [23]:
sn

array([[[ 1.58456562, -1.10596411, -0.5857986 , -0.28285884,
          1.26203527],
        [-0.96813015, -0.17746079,  0.0320866 , -0.24834951,
         -2.60370198],
        [-0.44059924, -2.01989248,  0.06496332,  0.38774794,
          0.21617842],
        [-0.01031115,  1.28526407,  1.43833233,  0.84437857,
         -0.49452877]],

       [[ 1.07534272,  0.408087  ,  0.78120499,  0.42814507,
         -0.45435475],
        [-1.7579894 ,  2.114143  ,  1.0234935 , -0.1791628 ,
         -1.28062655],
        [ 0.32623998,  0.1248641 , -0.70812123,  0.84687186,
          0.17742063],
        [ 0.84704828,  0.37749217, -1.09545804, -0.18802372,
          0.33017524]],

       [[ 0.33204925,  0.95956951, -1.66196504,  0.10086826,
          0.44120308],
        [-0.59569603, -0.405991  ,  0.52919773, -0.87957361,
         -1.52903142],
        [ 0.46443555,  1.21294195, -1.5026593 , -0.8095373 ,
         -0.34050297],
        [-0.28188537, -1.50283864,  0.29433849, -1.31369147,
          0.99318243]]])

In [24]:
b=np.random.randint(100,200,(3,4))  #

In [25]:
b

array([[148, 185, 182, 125],
       [191, 128, 109, 198],
       [165, 107, 189, 197]])

In [4]:
import pandas as pd

In [39]:
# 从标量值创建
s=pd.Series(100,index=[0,1,2,3])

In [40]:
s

0    100
1    100
2    100
3    100
dtype: int64

In [41]:
# 从字典创建
d={'a':1,'b':3,'c':5,'d':7}
sd=pd.Series(d)
sd2=pd.Series(d,index=['d','c','b'])

In [42]:
sd

a    1
b    3
c    5
d    7
dtype: int64

In [43]:
sd2

d    7
c    5
b    3
dtype: int64

In [44]:
# 从ndarray类型创建
n=pd.Series(np.arange(5))

In [45]:
n

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [46]:
m=pd.Series(np.arange(5),index=np.arange(9,4,-1))

In [47]:
m

9    0
8    1
7    2
6    3
5    4
dtype: int64

In [48]:
# 基本操作
sd

a    1
b    3
c    5
d    7
dtype: int64

In [49]:
sd.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [50]:
sd.values

array([1, 3, 5, 7])

In [51]:
sd['b'] # 第一种索引

3

In [52]:
sd[1] # 第二种索引，自动索引 同numpy

3

In [53]:
# numpy 中的运算切片都可以直接应用于Series
print(sd[:3])

a    1
b    3
c    5
dtype: int64

In [150]:
sd

a    1
b    3
c    5
d    7
dtype: int64

In [151]:
np.exp(sd)   #e的sd次方。 e的一次就是e=2.718

a       2.718282
b      20.085537
c     148.413159
d    1096.633158
dtype: float64

In [55]:
sd+sd

a     2
b     6
c    10
d    14
dtype: int64

In [152]:
sd.median()  #1357 的平均数

4.0

In [56]:
sd>sd.median()

a    False
b    False
c     True
d     True
dtype: bool

In [57]:
sd[sd>sd.median()]

c    5
d    7
dtype: int64

In [58]:
'c' in sd # 判断索引

True

In [59]:
1 in sd # 不判断value和自动索引

False

In [165]:
sd.get('q')

In [166]:
sd.get('q',default=10)  #没有q，不想错误，默认10

10

In [61]:
# 类似python中字典的方法

In [62]:
a=pd.Series(np.arange(4),index=['a', 'b', 'c', 'd'])
b=pd.Series(np.arange(5),index=['e', 'b', 'a', 'd','c'])
print(a)
print(b)

a    0
b    1
c    2
d    3
dtype: int64
e    0
b    1
a    2
d    3
c    4
dtype: int64

In [171]:
np.nan

nan

In [64]:
a+b # Series自动对齐不同索引的数据 广播运算，迁就那些维度高，形状大的数据结构

a    2.0
b    2.0
c    6.0
d    6.0
e    NaN
dtype: float64

In [65]:
#Series.name
a.name

In [66]:
a.name='一个series对象'
a.index.name='索引名字'

In [67]:
a

索引名字
a    0
b    1
c    2
d    3
Name: 一个series对象, dtype: int64

In [68]:
sd

a    1
b    3
c    5
d    7
dtype: int64

In [69]:
# 一维带标签的数组，非常类似于ndarray和字典的结合，根据索引进行对齐运算

### DataFrame

In [70]:
# 共用同一列索引的多列数据,类似于excel，常用二维的数据
# 有两个轴，为axis=0（索引列方向）和axis=1

In [5]:
#创建
df=pd.DataFrame(np.arange(10).reshape(2,5)) #0-10 reshape分成2行5列  np.arange(10)这是一维
df

   0  1  2  3  4
0  0  1  2  3  4
1  5  6  7  8  9

In [172]:
dt={'one':pd.Series(np.arange(2,5),index=['a','b','c']),
   'two':pd.Series(np.arange(4,8),index=['a','b','c','d'])}
dt

{'one': a    2
 b    3
 c    4
 dtype: int64,
 'two': a    4
 b    5
 c    6
 d    7
 dtype: int64}

In [73]:
df=pd.DataFrame(dt)
df

   one  two
a  2.0    4
b  3.0    5
c  4.0    6
d  NaN    7

In [74]:
pd.DataFrame(dt,index=['b','c','d'],columns=['two','one'])

   two  one
b    5  3.0
c    6  4.0
d    7  NaN

In [8]:
dl={'姓名':['张三','李四','王五','周六'],
   '身高':[180,175,182,165],
   '血型':['A','B','O','A']}
df=pd.DataFrame(dl,index=['stu1','stu2','stu3','stu4'])
df

      姓名   身高 血型
stu1  张三  180  A
stu2  李四  175  B
stu3  王五  182  O
stu4  周六  165  A

In [9]:
sd.get('q',default=10)  #没有q，不想错误，默认10

NameError: name 'sd' is not defined

In [10]:
df.index

Index(['stu1', 'stu2', 'stu3', 'stu4'], dtype='object')

In [11]:
df.columns # 都是索引类型,横着的索引

Index(['姓名', '身高', '血型'], dtype='object')

In [12]:
df.values # ndarray

array([['张三', 180, 'A'],
       ['李四', 175, 'B'],
       ['王五', 182, 'O'],
       ['周六', 165, 'A']], dtype=object)

In [13]:
# 访问DataFrame中的数据
df

      姓名   身高 血型
stu1  张三  180  A
stu2  李四  175  B
stu3  王五  182  O
stu4  周六  165  A

In [14]:
df['姓名'] # 列，一个series对象

stu1    张三
stu2    李四
stu3    王五
stu4    周六
Name: 姓名, dtype: object

In [15]:
df.姓名 # 列，一个series对象

stu1    张三
stu2    李四
stu3    王五
stu4    周六
Name: 姓名, dtype: object

In [17]:
df.loc['stu2'] # 行，series对象   loc=row

姓名     李四
身高    175
血型      B
Name: stu2, dtype: object

In [18]:
df.iloc[0]  #iloc 采取index的那一行

姓名     张三
身高    180
血型      A
Name: stu1, dtype: object

In [19]:
df['身高']['stu2']   #show某个具体元素

175

In [85]:
df.身高[1]

175

In [86]:
print(df.loc['stu2']['身高'])
print(df.loc['stu2'][1])

175
175

In [87]:
print(df.iloc[1,1])
print(df.iloc[1][1])

175
175

In [88]:
# 注意观察返回类型

In [89]:
df

      姓名   身高 血型
stu1  张三  180  A
stu2  李四  175  B
stu3  王五  182  O
stu4  周六  165  A

In [90]:
# reindex
df.reindex(index=['stu4', 'stu2', 'stu3', 'stu1'],columns=['身高', '血型', '姓名'])

       身高 血型  姓名
stu4  165  A  周六
stu2  175  B  李四
stu3  182  O  王五
stu1  180  A  张三

In [22]:
newc=df.columns.insert(3,'分数') #最后插入多一列分数

In [23]:
newc

Index(['姓名', '身高', '血型', '分数'], dtype='object')

In [24]:
df=df.reindex(columns=newc,fill_value=100)   #先把row_index改变，再填充value
df

      姓名   身高 血型   分数
stu1  张三  180  A  100
stu2  李四  175  B  100
stu3  王五  182  O  100
stu4  周六  165  A  100

In [25]:
df.drop('stu1') # 默认0轴=row

      姓名   身高 血型   分数
stu2  李四  175  B  100
stu3  王五  182  O  100
stu4  周六  165  A  100

In [26]:
df.drop('分数',axis=1)

      姓名   身高 血型
stu1  张三  180  A
stu2  李四  175  B
stu3  王五  182  O
stu4  周六  165  A

In [30]:
df['性别']='女' # 增加列

In [31]:
df

      姓名   身高 血型   分数 性别
stu1  张三  180  A  100  女
stu2  李四  175  B  100  女
stu3  王五  182  O  100  女
stu4  周六  165  A  100  女

In [32]:
df.loc['stu5']=1 #增加一行

In [33]:
df

      姓名   身高 血型   分数 性别
stu1  张三  180  A  100  女
stu2  李四  175  B  100  女
stu3  王五  182  O  100  女
stu4  周六  165  A  100  女
stu5   1    1  1    1  1

In [34]:
# DataFrame算数运算

In [35]:
a=pd.DataFrame(np.arange(12).reshape(3,4))
a

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [102]:
b=pd.DataFrame(np.arange(16).reshape(4,4))
b

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [103]:
a+b

      0     1     2     3
0   0.0   2.0   4.0   6.0
1   8.0  10.0  12.0  14.0
2  16.0  18.0  20.0  22.0
3   NaN   NaN   NaN   NaN

In [104]:
a*b

      0     1      2      3
0   0.0   1.0    4.0    9.0
1  16.0  25.0   36.0   49.0
2  64.0  81.0  100.0  121.0
3   NaN   NaN    NaN    NaN

In [105]:
b.add(a)

      0     1     2     3
0   0.0   2.0   4.0   6.0
1   8.0  10.0  12.0  14.0
2  16.0  18.0  20.0  22.0
3   NaN   NaN   NaN   NaN

In [106]:
b.add(a,fill_value=0) #替代后再运算

      0     1     2     3
0   0.0   2.0   4.0   6.0
1   8.0  10.0  12.0  14.0
2  16.0  18.0  20.0  22.0
3  12.0  13.0  14.0  15.0

In [107]:
a.mul(b,fill_value=1) # sub div

      0     1      2      3
0   0.0   1.0    4.0    9.0
1  16.0  25.0   36.0   49.0
2  64.0  81.0  100.0  121.0
3  12.0  13.0   14.0   15.0

In [108]:
c=pd.Series(np.arange(3))
c

0    0
1    1
2    2
dtype: int64

In [109]:
b-c # 在axis=1轴运算

      0     1     2   3
0   0.0   0.0   0.0 NaN
1   4.0   4.0   4.0 NaN
2   8.0   8.0   8.0 NaN
3  12.0  12.0  12.0 NaN

In [110]:
# 布尔运算
a

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [37]:
b

NameError: name 'b' is not defined

In [112]:
a>4 # 标量

       0      1      2      3
0  False  False  False  False
1  False   True   True   True
2   True   True   True   True

In [36]:
a>b # 同维度数据运算必须同尺寸

NameError: name 'b' is not defined

In [114]:
c=pd.DataFrame(np.full_like(a,5))
c

   0  1  2  3
0  5  5  5  5
1  5  5  5  5
2  5  5  5  5

In [115]:
a>c

       0      1      2      3
0  False  False  False  False
1  False  False   True   True
2   True   True   True   True

In [116]:
a[a>c]

     0    1     2     3
0  NaN  NaN   NaN   NaN
1  NaN  NaN   6.0   7.0
2  8.0  9.0  10.0  11.0

In [117]:
# 排序，索引，值

In [38]:
a

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [39]:
a=a.reindex([2,0,1],columns=[3,2,0,1]) # 打乱index顺序
a

    3   2  0  1
2  11  10  8  9
0   3   2  0  1
1   7   6  4  5

In [120]:
a=a.sort_index() # axis=0, ascending =True
a

    3   2  0  1
0   3   2  0  1
1   7   6  4  5
2  11  10  8  9

In [121]:
a=a.sort_index(axis=1,ascending=False)
a

    3   2  1  0
0   3   2  1  0
1   7   6  5  4
2  11  10  9  8

In [122]:
a.sort_values(3,ascending=False) # 默认安装axis= 0

    3   2  1  0
2  11  10  9  8
1   7   6  5  4
0   3   2  1  0

In [123]:
a.sort_values(2,axis=1)

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [124]:
a.index=['a','b','c']
a

    3   2  1  0
a   3   2  1  0
b   7   6  5  4
c  11  10  9  8

In [54]:
a.loc['d']=np.nan
a

      3     2    0    1
2  11.0  10.0  8.0  9.0
0   3.0   2.0  0.0  1.0
1   7.0   6.0  4.0  5.0
d   NaN   NaN  NaN  NaN

In [55]:
a.sort_values(2,ascending = True) # 空值在最后

      3     2    0    1
0   3.0   2.0  0.0  1.0
1   7.0   6.0  4.0  5.0
2  11.0  10.0  8.0  9.0
d   NaN   NaN  NaN  NaN

In [56]:
# 一些统计分析的函数
# 计算沿axis=0
a.sum()
a.count()
a.mean()
a.median()
a.var()
a.std()
a.min()
a.max()

3    11.0
2    10.0
0     8.0
1     9.0
dtype: float64

In [57]:
a.describe() # 返回也是一个dataframe

          3     2    0    1
count   3.0   3.0  3.0  3.0
mean    7.0   6.0  4.0  5.0
std     4.0   4.0  4.0  4.0
min     3.0   2.0  0.0  1.0
25%     5.0   4.0  2.0  3.0
50%     7.0   6.0  4.0  5.0
75%     9.0   8.0  6.0  7.0
max    11.0  10.0  8.0  9.0

In [58]:
a.describe()[3]

count     3.0
mean      7.0
std       4.0
min       3.0
25%       5.0
50%       7.0
75%       9.0
max      11.0
Name: 3, dtype: float64

In [59]:
a.describe().loc['max']

3    11.0
2    10.0
0     8.0
1     9.0
Name: max, dtype: float64

In [60]:
a

      3     2    0    1
2  11.0  10.0  8.0  9.0
0   3.0   2.0  0.0  1.0
1   7.0   6.0  4.0  5.0
d   NaN   NaN  NaN  NaN

In [61]:
a.cumsum()# 累加当前位置之前的数据 cumprod

      3     2     0     1
2  11.0  10.0   8.0   9.0
0  14.0  12.0   8.0  10.0
1  21.0  18.0  12.0  15.0
d   NaN   NaN   NaN   NaN

In [62]:
a.cumsum(axis=1) #按列累加

      3     2     0     1
2  11.0  21.0  29.0  38.0
0   3.0   5.0   5.0   6.0
1   7.0  13.0  17.0  22.0
d   NaN   NaN   NaN   NaN

In [63]:
a.cummax() # cummin 按行算max

      3     2    0    1
2  11.0  10.0  8.0  9.0
0  11.0  10.0  8.0  9.0
1  11.0  10.0  8.0  9.0
d   NaN   NaN  NaN  NaN

In [47]:
# Series 类型的一些函数
s=pd.Series(np.random.randint(1,10,4),index=['a','b','c','d'])  #np.random.randint(1,10,4)  1-10不包括10中数字 size=4
s

a    3
b    9
c    5
d    2
dtype: int64

In [49]:
s.idxmax() # 返回自定义索引 计算能够获取到最大值的索引位置(整数)  9最大->b

'b'

In [50]:
s.values.argmax() # 返回自动索引位置

1

In [64]:
a

      3     2    0    1
2  11.0  10.0  8.0  9.0
0   3.0   2.0  0.0  1.0
1   7.0   6.0  4.0  5.0
d   NaN   NaN  NaN  NaN

In [65]:
# 滚动计算
a.rolling(2).sum() # 跟之前的滚动

      3     2    0     1
2   NaN   NaN  NaN   NaN
0  14.0  12.0  8.0  10.0
1  10.0   8.0  4.0   6.0
d   NaN   NaN  NaN   NaN

In [139]:
a.rolling(2,axis=1).max() #横轴向右  列相加

    3     2     1    0
a NaN   3.0   2.0  1.0
b NaN   7.0   6.0  5.0
c NaN  11.0  10.0  9.0
d NaN   NaN   NaN  NaN

In [66]:
c=pd.DataFrame(np.random.randint(1,10,(3,4)))  #1-10 3行4列
c

   0  1  2  3
0  7  5  3  8
1  1  3  1  4
2  1  9  7  2

In [67]:
# 相关性分析 协方差 相关系数
np.cov(c)  #cov是协方差

array([[ 4.91666667,  1.75      , -6.75      ],
       [ 1.75      ,  2.25      ,  0.08333333],
       [-6.75      ,  0.08333333, 14.91666667]])

In [142]:
# 聚合操作

In [76]:
df=pd.DataFrame({
    'user_id':[1,2,1,3,3],
    'content_id':[1,1,2,2,2],
    'tag':['cool','nice','clever','clever','not-bad']
})
df

   user_id  content_id      tag
0        1           1     cool
1        2           1     nice
2        1           2   clever
3        3           2   clever
4        3           2  not-bad

In [77]:
grouped = df.groupby('user_id') #groupby函数主要的作用是进行数据的分组以及分组后地组内运算！

In [78]:
grouped

In [79]:
grouped['content_id'].mean()  #按照user_id分组，1有content_id两个 2有一个 3有两个

user_id
1    1.5
2    1.0
3    2.0
Name: content_id, dtype: float64

In [80]:
grouped.agg('mean')  #按照user_id分组 agg（）分组多个计算   （1+2）/2    。。。。

         content_id
user_id
1               1.5
2               1.0
3               2.0

In [147]:
company=["A","B","C"]
data=pd.DataFrame({
    "company":[company[x] for x in np.random.randint(0,len(company),10)],   #compamy[x]是说index，0-3不包括3 10个
    "salary":np.random.randint(5,50,10),
    "age":np.random.randint(15,50,10)
}
)
data

  company  salary  age
0       C      36   46
1       A      35   24
2       A      40   48
3       B      42   37
4       A      17   32
5       A      26   49
6       A      35   17
7       A      22   38
8       C      37   15
9       B      16   37